zhanzr/LPC54114-Board/sdmmc/sdmmc_2.1.1/src/fsl_sdspi.c
status_t SDSPI_WriteBlocks(sdspi_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card);
    assert(card->host);
    assert(buffer);
    assert(blockCount);

    uint32_t offset;
    uint32_t i;
    sdspi_host_t *host;
    sdspi_command_t command = {0};

    if (SDSPI_CheckReadOnly(card))
    {
        return kStatus_SDSPI_WriteProtected;
    }

    offset = startBlock;
    if (!IS_BLOCK_ACCESS(card))
    {
        offset *= card->blockSize;
    }

    /* Send command and writes data. */
    host = card->host;
    if (blockCount == 1U)
    {
        command.index = kSDMMC_WriteSingleBlock;
        command.argument = offset;
        command.responseType = kSDSPI_ResponseTypeR1;
        if (kStatus_Success != SDSPI_SendCommand(host, &command, FSL_SDSPI_TIMEOUT))
        {
            return kStatus_SDSPI_SendCommandFailed;
        }

        if (command.response[0U])
        {
            return kStatus_SDSPI_ResponseError;
        }

        if (kStatus_Success != SDSPI_Write(host, buffer, card->blockSize, kSDSPI_DataTokenSingleBlockWrite))
        {
            return kStatus_SDSPI_WriteFailed;
        }
    }
    else
    {
#if defined FSL_SDSPI_ENABLE_PRE_ERASE_ON_WRITE
        /* Pre-erase before writing data */
        if (kStatus_Success != SDSPI_SendApplicationCmd(card))
        {
            return kStatus_SDSPI_SendApplicationCommandFailed;
        }

        command.index = kSDAppSetWrBlkEraseCount;
        command.argument = blockCount;
        command.responseType = kSDSPI_ResponseTypeR1;
        if (kStatus_Success != SDSPI_SendCommand(host->base, &command, FSL_SDSPI_TIMEOUT))
        {
            return kStatus_SDSPI_SendCommandFailed;
        }

        if (req->response[0U])
        {
            return kStatus_SDSPI_ResponseError;
        }
#endif

        memset(&command, 0U, sizeof(sdspi_command_t));
        command.index = kSDMMC_WriteMultipleBlock;
        command.argument = offset;
        command.responseType = kSDSPI_ResponseTypeR1;
        if (kStatus_Success != SDSPI_SendCommand(host, &command, FSL_SDSPI_TIMEOUT))
        {
            return kStatus_SDSPI_SendCommandFailed;
        }

        if (command.response[0U])
        {
            return kStatus_SDSPI_ResponseError;
        }

        for (i = 0U; i < blockCount; i++)
        {
            if (kStatus_Success != SDSPI_Write(host, buffer, card->blockSize, kSDSPI_DataTokenMultipleBlockWrite))
            {
                return kStatus_SDSPI_WriteFailed;
            }
            buffer += card->blockSize;
        }
        if (kStatus_Success != SDSPI_Write(host, 0U, 0U, kSDSPI_DataTokenStopTransfer))
        {
            return kStatus_SDSPI_WriteFailed;
        }

        /* Wait the card programming end. */
        if (kStatus_Success != SDSPI_WaitReady(host, FSL_SDSPI_TIMEOUT))
        {
            return kStatus_SDSPI_WaitReadyFailed;
        }
    }

    return kStatus_Success;
}
